app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]
UPDATE "users" SET "remember_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["remember_digest", "$2a$04$yBSVcdd8Md0wm3lEPulvmeMgV74WKolQhwN1xrBDvRR7/xblG6U/G"], ["updated_at", "2020-04-20 07:02:16.156258"], ["id", 762146111]]
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)
    if user && user.authenticate(params[:session][:password])
      log_in user
      params[:session][:remember_me] == '1' ? remember(user) : forget(user)
      user.update_attribute(:last_active, Time.now)